[
  {
    "subject": "The 27th STePS ---- Last Chance to Register for STePS — Free Buffet Dinner Included! --- Closes 5th November",
    "body": "Dear Students, \n We'd like to invite you to the The 27th STePS (SoC Term Project Showcase) held on 12-Nov-2025 [Physical Event], the largest developer centric event of the school. \n\n Registration opens today!  https://bit.ly/steps27r \n\n STePS has three goals:\nE3 :  Education through self-directed peer-learning by facilitating an environment to freely think, create, criticise and reflect with strong support from educational institutes, industry and government agencies; Employment through modern flipped career fair where students demonstrate their skills live to the talent acquisition departments to assess; and Entrepreneurship through collaboration with Industry and Investors.\nFrom cool new Healthcare Innovations and Game  projects 🎮 to exciting AI/ML enterprise apps📱, there’s lots to see and and learn from peers. 😉Register now to view (and vote!) for your favourite projects at https://uvents.nus.edu.sg/event/27th-steps.   \n\n(NB:- Last date for registration of Standard Tickets with Buffet Dinner: 05 Nov 2025) \nYou can use your registration ID as voter TOKEN to Vote for the best projects."
  },
  {
    "subject": "Win a Free iPhone Today – Limited Time Offer!",
    "body": "Dear User,\n\nCongratulations! 🎉 You have been selected to receive a free iPhone in our exclusive giveaway. This is a limited-time offer valid today only.\n\nClaim your prize by clicking the link here: http://freelottery.example.com\n\nAct quickly! This offer expires at midnight today. Ensure your entry is submitted to be eligible.\n\nStay safe and do not share your claim link with anyone else."
  },
  {
    "subject": "Black Friday Mega Sale – Up to 70% OFF!",
    "body": "Dear Shopper,\n\nBlack Friday is here! Don’t miss our biggest sale of the year with discounts of up to 70% on electronics, clothing, and more.\n\nShop online now at https://shop.example.com/blackfriday\n\nSale starts today and lasts only until Black Friday ends. Hurry, stock is limited!\n\nDiscover amazing deals and save big this shopping season."
  },
  {
    "subject": "New Version of ExampleApp is Now Available",
    "body": "Dear Valued User,\n\nWe’re excited to announce that a new version of ExampleApp is now available with enhanced performance and brand-new features.\n\nUpdate today to enjoy improvements: https://exampleapp.com/download\n\nEnsure you’re using the latest version to get the best experience and enjoy our new functionalities.\n\nDon’t miss out on these updates!"
  },
  {
    "subject": "Important Security Alert – New Device Login Detected",
    "body": "Dear User,\n\nWe detected a login to your account from a new device today. If this wasn’t you, we recommend reviewing your account activity immediately.\n\nCheck your activity here: https://example.com/account-activity\n\nIf you notice any suspicious behavior, please secure your account by updating your password and enabling two-step verification."
  },
  {
    "subject": "Password Reset Requested",
    "body": "Dear User,\n\nWe received a request to reset your account password. If you initiated this request, please proceed by clicking the link below:\n\nReset your password: https://example.com/reset-password\n\nIf you did not request a password reset, you can safely ignore this email and your account will remain secure."
  },
  {
    "subject": "Flash Sale – 24 Hours Only!",
    "body": "Dear Customer,\n\nExciting news! For the next 24 hours, enjoy 40% off on all items in our store.\n\nShop your favorite styles now: https://deals.example.com\n\nDon’t miss this limited-time flash sale. Deals end in 24 hours, so grab your favorites while stocks last!"
  },
  {
    "subject": "Your Subscription Will Renew on November 15",
    "body": "Dear Subscriber,\n\nYour Premium subscription is set to renew automatically on November 15, 2025. You will be charged $9.99.\n\nView billing details and manage your subscription: https://billing.example.com\n\nIf you wish to make changes or cancel, please do so before the renewal date to avoid unwanted charges."
  },
  {
    "subject": "Two-Step Verification Code: 426706",
    "body": "Dear User,\n\nFor your account security, please use the following verification code to complete the login process: 426706.\n\nDo not share this code with anyone. This code is valid for a short period only.\n\nEnsure your account remains secure by following best practices and enabling two-factor authentication."
  },
  {
    "subject": "New Reply to Your Post in 'Python Beginners'",
    "body": "Dear User,\n\nUser @alex_dev has replied to your post in the 'Python Beginners' forum: 'You can use list comprehension here.'\n\nView and reply to the discussion here: https://forumhub.com/thread/9234\n\nJoin the conversation and engage with other developers. Share your insights and learn from the community!"
  },
  {
    "subject": "Privacy Policy Update Effective December 1",
    "body": "Dear User,\n\nWe have updated our privacy policy to provide more transparency about how we handle your data. The new policy takes effect on December 1, 2025.\n\nRead the updated policy here: https://example.com/privacy\n\nPlease review these changes to understand how your information is managed and the steps we take to protect your privacy."
  }
]






